import pytest
"""
Реализуйте структуру данных, представляющую собой расширенную структуру стек. Необходимо поддерживать добавление элемента на вершину стека, удаление с вершины стека, и необходимо поддерживать операции сложения, вычитания, умножения и целочисленного деления.

Операция сложения на стеке определяется следующим образом. Со стека снимается верхний элемент (top1), затем снимается следующий верхний элемент (top2), и затем как результат операции сложения на вершину стека кладется элемент, равный top1 + top2.

Аналогичным образом определяются операции вычитания (top1 - top2), умножения (top1 * top2) и целочисленного деления (top1 // top2).

Реализуйте эту структуру данных как класс ExtendedStack, отнаследовав его от стандартного класса list.
Требуемая структура класса:
"""


class ExtendedStack(list):


    def sum(self):
        top1 = self.pop(-1)
        top2 = self.pop(-1)
        return self.append(top1 + top2)
        # операция сложения

    def sub(self):
        top1 = self.pop(-1)
        top2 = self.pop(-1)
        return self.append(top1 - top2)
        # операция вычитания

    def mul(self):
        top1 = self.pop(-1)
        top2 = self.pop(-1)
        return self.append(top1 * top2)
        # операция умножения

    def div(self):
        top1 = self.pop(-1)
        top2 = self.pop(-1)
        return self.append(top1 // top2)
        # операция целочисленного деления




if __name__ == "__main__":
    ml = ExtendedStack([1, 2, 3, 4, -3, 3, 5, 10])
    ml.sum()
    print(ml)  # [1, 2, 3, 4, -3, 3, 15]




